#include <iostream>
#include <string>
using namespace std;

//возможно странный цикл но рабочий. Долго сидел выстаривал алгоритм чтобы все работало.
// также старался не заводить лишние переменные для оптимизации. Сейчас это особо не влияет, но все же.
int main(){
    int n;
    cout << "Введите высоту елки: ";
    cin >> n;

    if (n <= 0) {cout << "Ошибка, высота должна быть больше 0"; return 0;}
    int x = 1;
    for(int i = 0; i < n + 1; i++){
        for(int y = 0; y < n; y++){
            if (i == 0) i += 1;
            if (y < n - i) cout << " ";
        }
        cout << string(x, '#') << "\n";
        x += 2;
    }
    return 0;
}