#include <iostream>
using namespace std;

int main(){
    // 12 персон за столом, для каждого 1 - приборы, 2 - тарелки, 3 - стулья
    int person[12][3] = {{4, 3, 1}, 
                         {4, 3, 1},
                         {3, 2, 1},
                         {3, 2, 1},
                         {3, 2, 1},
                         {3, 2, 1},
                         {3, 2, 1},
                         {3, 2, 1},
                         {3, 2, 1},
                         {3, 2, 1},
                         {3, 2, 1},
                         {3, 2, 1},
                        };
    
    person[4][2]++; // добавляем еще стул. 5 место 1 ряда. Место под индексом 4
    
    person[8][0]--; // 3 место 2 ряда. 1 ряд = 6 + 3 = 9 место. 8 индекс. Украдена ложка
    
    person[0][0]--; // вип персон отдал ложку
    person[8][0]++;

    person[0][1]--; // официант забрал тарелку


    for (int i = 0; i < 12; i++){
        for (int j = 0; j < 3; j++){
            cout << person[i][j] << " ";
        }
        cout << "\n";
    }
    
    return  0;
}